---
kind: method
id: M:Autodesk.Revit.UI.Macros.UIMacroManager.GetUIDocumentMacroSecurityOptions(Autodesk.Revit.UI.UIApplication)
source: html/8744336d-2d1a-5199-dee1-9cca84027d62.htm
---
# Autodesk.Revit.UI.Macros.UIMacroManager.GetUIDocumentMacroSecurityOptions Method

Gets the UI document macro security options.

## Syntax (C#)
```csharp
public static UIDocumentMacroOptions GetUIDocumentMacroSecurityOptions(
	UIApplication application
)
```

## Parameters
- **application** (`Autodesk.Revit.UI.UIApplication`) - The UI application.

## Returns
Returns the UI document macro security options.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was NULL